# Phase 1 Project WIP

EDA of Box Office Mojo Data

In [1]:
#Import 
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
df = pd.read_csv('zippedData/bom.movie_gross.csv')

In [3]:
df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [4]:
df.index

RangeIndex(start=0, stop=3387, step=1)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [6]:
df.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [7]:
#look at rows with null values
#i'm thinking it could be interesting to look at foreign $
#but that's the column missing the most info

df_na = df[df.isnull().any(axis=1)]
df_na.head()

,title,studio,domestic_gross,foreign_gross,year
210,Outside the Law (Hors-la-loi),NaN,96900.0,3300000,2010
222,Flipped,WB,1800000.0,NaN,2010
230,It's a Wonderful Afterlife,UTV,NaN,1300000,2010
254,The Polar Express (IMAX re-issue 2010),WB,673000.0,NaN,2010
267,Tiny Furniture,IFC,392000.0,NaN,2010

In [8]:
#check and remove duplicates

df.drop_duplicates(inplace = True)
df.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            3377, 3378, 3379, 3380, 3381, 3382, 3383, 3384, 3385, 3386],
           dtype='int64', length=3387)

In [9]:
#checkout number of studios in the list
df['studio'].nunique()

257

In [10]:
#get a list of unique studio names

studio_list = []
for studio in df['studio']:
    studio_list.append(studio)

In [11]:
unique_studios = list(set(studio_list))

In [12]:
df['domestic_gross'].values

array([4.150e+08, 3.342e+08, 2.960e+08, ..., 2.500e+03, 2.400e+03,
       1.700e+03])

In [13]:
#get rid of nulls
df.dropna(inplace = True)

In [14]:
#remove commas from foreign_gross
df['foreign_gross'] = df['foreign_gross'].str.replace(',', '')

In [15]:
#change type to float from object
df['foreign_gross'] = df['foreign_gross'].astype(float)

In [16]:
#check to see if dropna worked
df.isna().sum()

title             0
studio            0
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [17]:
#check to see if astype worked
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   float64
 4   year            2007 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 94.1+ KB

In [18]:
#look at mean and median gross 

print(df.foreign_gross.mean())
print(df.foreign_gross.median())

75790384.84130543
19400000.0

In [19]:
#look at mean and median gross - domestic

print(df.domestic_gross.mean())
print(df.domestic_gross.median())

47019840.20179372
16700000.0

In [20]:
#look at top domestically grossing

top_domestic = df.nlargest(20,'domestic_gross')
#top_domestic

In [21]:
#look at top foreign grossing

top_foreign = df.nlargest(50,'foreign_gross')
#top_foreign

In [22]:
#look at films that are in both top lists, if any

top_films = []

for film in list(top_domestic['title'].values): 
    if film in list(top_foreign['title'].values):
        top_films.append(film)

# Thoughts so far (9/27)

Finding genres and movie/ tv show types that perfrom well domestically and internationally seems feasible. 

Releasing a tv show or movie both domestically and internationally could have the benefit of revenue from multiple sources. 

However, what are the additional costs of releasing internationally? Would it be an option to only release on highest-earning platforms? (ie, instead of releasing everywhere - including lower-earning platforms) If so, would that save enough to offset the cost of releasing internationally?

Which countries should be focused on? Probably English-speaking countries? Where is American made content most popular?

In [23]:
imdb_df1 = pd.read_csv('zippedData/imdb.title.ratings.csv')
imdb_df1.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [24]:
imdb_df2 = pd.read_csv('zippedData/imdb.title.akas.csv')
imdb_df2.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [25]:
imdb_df3 = pd.read_csv('zippedData/imdb.title.basics.csv')
imdb_df3.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [26]:
imdb_df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [27]:
#set index for datasets to join

imdb_df3.set_index('primary_title',inplace=True)
df.set_index('title',inplace=True)

In [28]:
#check for blanks
imdb_df3.isna().sum()

tconst                 0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [29]:
#replace blank genres

imdb_df3['genres'].fillna('No Genre Listed', inplace=True)

In [30]:
#join Box Offic Mojo w/ IMDB 3 to look at titles that appear in both 
joined_df = imdb_df3.join(df, how = 'inner')

In [31]:
#see how many titles appeared in both

joined_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2019 entries, '71 to Zootopia
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   tconst           2019 non-null   object
 1   original_title   2019 non-null   object
 2   start_year       2019 non-null   int64
 3   runtime_minutes  1902 non-null   float64
 4   genres           2019 non-null   object
 5   studio           2019 non-null   object
 6   domestic_gross   2019 non-null   float64
 7   foreign_gross    2019 non-null   float64
 8   year             2019 non-null   int64
dtypes: float64(3), int64(2), object(4)
memory usage: 157.7+ KB

Only a handful of movies were in both datasets, so not as useful as I'd hoped